In [2]:
import pandas as pd

#create a series of three different colours
colours = pd.Series(["Blue", "Red", "White"])

colours

0     Blue
1      Red
2    White
dtype: object

In [3]:
#create a series of 3 different car types
cars = pd.Series(["BMW","Toyota","Honda"])

cars

0       BMW
1    Toyota
2     Honda
dtype: object

In [4]:
#combines the series of cars and colours into DataFrame

car_data = pd.DataFrame({
    "Car Make": cars,
    "Colour": colours
})

car_data

  Car Make Colour
0      BMW   Blue
1   Toyota    Red
2    Honda  White

In [5]:
#import data and turn to a dataframe
car_sales = pd.read_csv("car-sales.csv")

car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [6]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [7]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [8]:
#grabbing information about the data frame using info()

car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes